app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Day la noi dung dau tien"], ["user_id", 1], ["created_at", "2015-09-30 21:19:32.171351"], ["updated_at", "2015-09-30 21:19:32.171351"]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT 1  [["id", 1]]